## ====================================================================================================================
## Layer 00 => Bootstrap
## ====================================================================================================================

tap  'rcmdnk/file'
brew 'brew-file'

brew 'mas'

## ====================================================================================================================
## Layer 01 ❱ Basic Shell Environment
## ====================================================================================================================

# Bash is the Bourne Again SHell. Bash is an sh-compatible shell.
brew 'bash'

# Programmable completion functions for bash
brew 'bash-completion'

# Zsh is a shell designed for interactive use.
brew 'zsh'

# A plugin for zsh to make your command line life much easier.
brew 'zsh-syntax-highlighting'

# Another really helpful zsh plugin.
brew 'zsh-autosuggestions'

# For better argument parsing in shell scripts
brew 'gnu-getopt'

# Cross-shell prompt
brew 'starship'

# GPU-based terminal emulator
cask 'kitty'

# Terminal multiplexer
brew 'tmux'

# Manage complex tmux sessions easily
brew 'tmuxinator'


# ---------------------------------------------------------------------------------------------------------------------
# Layer 01 ❱ Basic Shell Environment ❱ GNU Utilities
# ---------------------------------------------------------------------------------------------------------------------

# Basic file, shell and text manipulation utilities of the GNU operating system.
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'inetutils'
brew 'watch'
brew 'wdiff'

# Core GNU programming tools
brew 'gdb'  # gdb requires further actions to make it work. See `brew info gdb`.
brew 'gpatch'
brew 'm4'
brew 'make' # GNU make
brew 'automake'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 01 ❱ Basic Shell Environment ❱ Better Utilities
# ---------------------------------------------------------------------------------------------------------------------

# bat is like `cat` plus line numbers, syntax highlighting, and more.
brew 'bat'

# Yet another cross-platform graphical process/system monitor
brew 'bottom'

# curl is a command line tool for transferring data with URL syntax.
brew 'curl', link: true

# More intuitive version of du in rust
brew 'dust'

# Calculator REPL similar to bc(1)
brew 'eva'

# Modern, maintained replacement for ls
brew 'eza'

# fd: a simple, fast and user-friendly alternative to find.
brew 'fd'

# Find files with SQL-like queries
brew 'fselect'

# Gnuplot is a portable command-line driven graphing utility.
brew 'gnuplot'

# GraphicsMagick is the swiss army knife of image processing.
brew 'graphicsmagick'

# TODO
brew 'graphviz'

# TODO
brew 'imagemagick'

# JQ clone focussed on correctness, speed, and simplicity
brew 'jaq'

# Interactive JSON filter using jq
brew 'jnv'

# less is like `more` plus has more capability.
brew 'less'

# Fly through your shell history
brew 'mcfly'

# ripgrep is text search; we prefer it over grep, ag, git grep, ucg, pt, sift.
brew 'ripgrep'

# rsync is the classic unix file synchronizer.
brew 'rsync'

# Intuitive find & replace CLI
brew 'sd'

# Tad is CSV viewer with features for pivot, search, etc.
cask 'tad'

# Unison is a high-level file synchronization utility.
brew 'unison'

# Visualization Toolkit for manipulating and displaying scientific data
brew 'vtk'

# Wget is a free software package for retrieving files using HTTP and FTP.
brew 'wget'

# yq is a lightweight and flexible command-line YAML processor.
brew 'yq'

# The `z` command to `cd` among directories.
brew 'zoxide'

# Zstandard is the best modern compression
brew 'zstd'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 01 ❱ Basic Shell Environment ❱ Security-Related
# ---------------------------------------------------------------------------------------------------------------------

# bcrypt is high quality encryption that is very popular
brew 'bcrypt'

# GNU Privacy Guard (GnuPG) provides encryption as a free replacement for PGP.
brew 'gpg'
brew 'pinentry-mac'
brew 'gpg-tui'

# Pass, a Unix password manager for the command line
brew 'pass'

# OpenSSL is an open-source implementation of the SSL and TLS protocols.
brew 'openssl'

# scrypt is high quality encryption
brew 'scrypt'
cask 'gpgfrontend'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 01 ❱ Basic Shell Environment ❱ Editors
# ---------------------------------------------------------------------------------------------------------------------

# Spell, grammar, writing, checkers
brew 'aspell'
brew 'proselint'

# Emacs editor with extra features; recommended by Spacemacs and Doom emacs
tap 'd12frosted/emacs-plus'
brew 'emacs-plus@30'

# MacDown simple markdown editor
cask 'macdown'

# MacTex: LaTeX document preparation system with high-quality typesetting.
cask 'mactex'

# GUI for vim, made for macOS
cask 'macvim-app'

# Free (GNU) replacement for the Pico text editor
brew 'nano'

# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'

# Pandoc document convert
brew 'pandoc', link: true

## ====================================================================================================================
## Layer 02 => System Integration
## ====================================================================================================================

# Application launcher and productivity software
cask 'alfred', adopt: true

# Multi-cloud backup application
cask 'arq'

# A better console tool
cask 'console'

# Google Drive client for Mac
cask 'google-drive'

# The Launchpad Replacement macOS 26 Deserves
mas 'Launchie App Launcher', id: 6752657468

# Cable-free audio router
cask 'loopback'

# Used to access context-specific actions when text is selected
cask 'popclip'

# Sound and audio controller
cask 'soundsource'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 02 => System Integration ❱ Containers
# ---------------------------------------------------------------------------------------------------------------------

# ContaiNERD CTL - Docker-compatible CLI for containerd
brew 'neonctl'

# Linux virtual machinesfi
brew 'lima'

# Container runtimes on MacOS (and Linux) with minimal setup
brew 'colima'

# Additional guest agents for Lima
brew 'lima-additional-guestagents'

# Open source container development tool (AWS)
cask 'finch'

# Generic machine emulator and virtualizer
cask 'qemu'

# Rancher Desktop - Container Management and Kubernetes on the Desktop
cask 'rancher'

# OrbStack - Replacement for Docker Desktop
cask 'orbstack'

# Oracle VirtualBox
cask 'virtualbox'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 02 => System Integration ❱ Fonts
# ---------------------------------------------------------------------------------------------------------------------

cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-nerd-font'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-fira-sans-condensed'
cask 'font-fira-sans-extra-condensed'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg'
cask 'font-meslo-lg-nerd-font'
cask 'font-linux-libertine'

## ====================================================================================================================
## Layer 03 => General-Purpose Productivity
## ====================================================================================================================

# Client to install Adobe apps
cask 'adobe-creative-cloud'

# Browser & Social
cask 'google-chrome'
# cask 'firefox'
# cask 'brave-browser'

# Communication clients
cask 'messenger'
cask 'signal'
cask 'slack', adopt: true
cask 'whatsapp'
cask 'zoom', adopt: true

mas 'PDF Expert – Edit, Sign PDFs', id: 1055273043

# Microsof Office is a large suite of software for documents, spreadsheets, diagrams.
cask 'microsoft-office'

# Proton suite of privacy-focused apps
cask 'proton-drive', adopt: true
cask 'proton-mail', adopt: true
cask 'proton-pass', adopt: true
cask 'protonvpn', adopt: true
cask 'standard-notes', adopt: true

mas 'Proton Pass for Safari', id: 6502835663

# Damn fine LaTeX editor
cask 'texifier'

# Diagramming
cask 'omnigraffle', adopt: true

# Simple CAS for Mac
mas 'MathStudio', id: 829912893

# Anthropic's official Claude AI desktop app
cask 'claude', adopt: true

# Finder/Menubar extensions
mas 'Meeting Reminder In Your Face', id: 1476964367
mas 'Plock • Pop-up Clock', id: 1642528649
mas 'FileUtils', id: 6477607708

# Utilities
mas 'Cicero: A Unicode® Tool', id: 1480977453
mas 'Ultra Character Map', id: 520265986

## ====================================================================================================================
## Layer 04 => Development Tools
## ====================================================================================================================

# ===== No longer used; kept for reference =====
# Settings repository URL: https://github.com/johnstonskj/idea-settings.git
# cask 'intellij-idea-ce'
# cask 'sublime-text'
# cask 'sublime-merge'
# text wrangler
# mas 'Tap Forms Organizer 5 Database', id: 1081981112
# mas 'Tap Forms Database Pro', id: 1527890083
# ===== No longer used; kept for reference =====

# Package/environment managers
brew 'direnv' # Load/unload env-vars based on $PWD
brew 'mise'   # Polyglot runtime manager

brew 'dotenv-linter' # Lightning-fast linter for .env files written in Rust


# Build coördination tools
brew 'cmake' # Cross-platform make
brew 'cmake-lint'
brew 'just'

# Diff/merge tools
brew 'diff-so-fancy'
brew 'difftastic'

# Git is a free and open source distributed version control system.
brew 'git'
brew 'git-crypt'
brew 'git-delta' # set as pager
brew 'git-extras'
brew 'git-lfs'
brew 'git-machete'
brew 'git-cliff'
brew 'commitlint'
brew 'multi-git-status'

brew 'gitlint'
brew 'gitwatch'
brew 'fswatch'

brew 'tig'
cask 'gitkraken-cli'
cask 'gitfinder'
cask 'gitbutler'

# Github command-line interface
brew 'gh'
brew 'github-mcp-server'

# Documentation tools
brew 'mdbook'     # Create online books from Markdown
brew 'plantuml'   # Draw UML diagrams from text

# Source code line counter
brew 'tokei'

# Xquartz X.Org X Window System that runs on OS X; needed for some image software.
cask 'xquartz'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 04 => Development Tools ❱ Testing
# ---------------------------------------------------------------------------------------------------------------------

# Simple API client (Postman-like) in your terminal
brew 'atac'

# Charles: enables a developer to view HTTP traffic.
# cask 'charles'

# Command-line benchmarking tool
brew 'hyperfine'

# Insomnia: REST client for API testing.
# cask 'insomnia'

# Postman: a complete API Development Environment.
# cask 'postman'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 04 => Development Tools ❱ Programming Languages
# ---------------------------------------------------------------------------------------------------------------------

# GCC GNU Compiler Collection
brew 'gcc'

# LLVM compiler
brew 'llvm'

# GNU CLISP, a Common Lisp implementation
brew 'clisp'

# Coq proof assistant for higher-order logic
brew 'rocq'
brew 'rocq-elpi'

# GNU Ubiquitous Intelligent Language for Extensions
brew 'guile'
brew 'guile-fibers'
brew 'guile-gnutls'

# Node.js is a JavaScript platform for building fast, scalable network app.
brew 'node'
brew 'nvm'

# V8 JavaScript Engine.
brew 'v8'

brew 'jsonlint'

# OCaml: General purpose programming language in the ML family
brew 'ocaml'
brew 'ocaml-findlib'
brew 'ocaml-zarith'
brew 'ocamlbuild'
brew 'opam'

# Python programming language, esp. for systems scripting.
brew 'python3'
brew 'pylint'
brew 'uv'

# Ruby programming language; compare `perl`, `python`.
brew 'ruby'

# Also, https://rvm.io/rvm/install

# Rust!!!!
brew 'rustup'

# LSP server for Rust
brew 'rust-analyzer'

# Cargo commands
brew 'cargo-audit'
brew 'cargo-binstall'
brew 'cargo-cache'
brew 'cargo-depgraph'
brew 'cargo-deny'
brew 'cargo-edit'
brew 'cargo-expand'
brew 'cargo-flamegraph'
brew 'cargo-generate'
brew 'cargo-nextest'
brew 'cargo-outdated'
brew 'cargo-shear'
brew 'cargo-udeps'
brew 'cargo-update'

# Modern programming language in the Lisp/Scheme family
cask 'racket'

# Another Mac-specific Scheme
mas 'LispPad', id: 1258939760

# A variety of scheme implementations
brew 'chezscheme'
# brew 'chibi-scheme'
# brew 'gambit-scheme'
# brew 'gerbil-scheme'
# brew 'mit-scheme'
# brew 'sagittarius-scheme'
# brew 'scheme48'
# brew 'sisc-scheme'

# Shell script syntax check linter
brew 'shellcheck'

# brew 'gnu-smalltalk'

brew 'sql-lint'

# High-performance system programming language.
brew 'swift'
brew 'swiftly'
brew 'swift-format'
brew 'swiftlint'

# YAML lint validator
brew 'yamllint'

# ---------------------------------------------------------------------------------------------------------------------
# Layer 04 => Development Tools ❱ IDE & Agents
# ---------------------------------------------------------------------------------------------------------------------

# Visual Studio Code editor
cask 'visual-studio-code'

# Kiro: agent-based IDE
cask 'kiro', adopt: true

# Xcode, full installation
mas 'Xcode', id: 497799835
cask 'github-copilot-for-xcode'

# Carthage Xcode project dependency manager.
brew 'carthage'

# Terminal-based AI coding assistant
cask 'claude-code'
brew 'claude-cmd'
brew 'claude-hooks'
brew 'claudekit'

# Finder extension to use Git
mas 'SnailGit – Git for Finder', id: 847260112

cask 'jupyterlab-app'

# Swift Development Tools from the Mac App Store
mas 'Swift Playground', id: 1496833156
mas 'Swifter for SwiftUI', id: 1621133381
mas 'DetailsPro', id: 1524366536

# Make iOS and macOS widgets in JavaScript
mas 'ScriptWidget', id: 1555600758

mas 'SQLPro Studio', id: 985614903

mas 'Ninox Database', id: 901110441

# ---------------------------------------------------------------------------------------------------------------------
# Layer 04 => Development Tools ❱ Runtime
# ---------------------------------------------------------------------------------------------------------------------

brew 'awscli'
brew 'awscli-local'
brew 'aws-cdk'
brew 'aws-keychain'

# SQLite database: self-contained, serverless, zero-configuration, transactional engine.
brew 'sqlite', link: true

# High-performance, asynchronous messaging library
brew 'zeromq'

## ====================================================================================================================
## Layer 05 => Personal Apps
## ====================================================================================================================

# Track money & budgets
mas 'Copilot: Track & Budget Money', id: 1447330651

# Music Creation and MIDI Tools
cask 'midikeys'
cask 'bitwig-studio'
cask 'native-access'
cask 'arturia-software-center'

# cask 'supercollider'
# cask 'cycling74-max'

mas 'GarageBand', id: 682658836

mas 'Audulus 4', id: 1592022030
mas 'Animoog Z Synthesizer', id: 1586841361
mas 'Minimoog Model D Synthesizer', id: 1339418001
mas 'Model 15 Modular Synthesizer', id: 1041465860

mas 'MIDI Connect', id: 6476070288
mas 'QuickMIDI', id: 1459790045
mas 'Widi Plus', id: 1115231926

# MUsic Listening
mas 'Endel: Focus & Sleep Sounds', id: 1346247457
mas 'Silicio Mini Player + Widgets', id: 933627574

# mas 'Linn', id: 1292218680 <= iPad app
mas 'Linn Kazoo', id: 848937349

# The best dive logger
mas 'DiveLogDT', id: 411603212

# Widgets
mas 'Lockera Widgets', id: 6466819847
mas 'iStatistica Pro', id: 1447778660

# Finder/Menubar extensions
mas 'New Terminal Here', id: 1067646949
mas 'Webcam Settings', id: 533696630
# mas 'QR Clipboard', id: 869183896 <= maybe?

# Amateur Radio
mas 'Morse: Code training to CW guru', id: 923315129
mas 'QTH.app', id: 6740310746
mas 'SDR Control for Icom', id: 1592313285
mas 'RUMlogNG', id: 964454561

# General Odds and Ends
# mas 'Parcel - Delivery Tracking', id: 375589283
